apple-open-source/macos/IOUSBFamily/AppleUSBUHCI/Headers/AppleUSBUHCI.h
/*
 * Copyright (c) 2004 Apple Computer, Inc. All rights reserved.
 *
 * @APPLE_LICENSE_HEADER_START@
 * 
 * This file contains Original Code and/or Modifications of Original Code
 * as defined in and that are subject to the Apple Public Source License
 * Version 2.0 (the 'License'). You may not use this file except in
 * compliance with the License. Please obtain a copy of the License at
 * http://www.opensource.apple.com/apsl/ and read it before using this
 * file.
 * 
 * The Original Code and all software distributed under the License are
 * distributed on an 'AS IS' basis, WITHOUT WARRANTY OF ANY KIND, EITHER
 * EXPRESS OR IMPLIED, AND APPLE HEREBY DISCLAIMS ALL SUCH WARRANTIES,
 * INCLUDING WITHOUT LIMITATION, ANY WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, QUIET ENJOYMENT OR NON-INFRINGEMENT.
 * Please see the License for the specific language governing rights and
 * limitations under the License.
 * 
 * @APPLE_LICENSE_HEADER_END@
 */
 

#ifndef _IOKIT_AppleUSBUHCI_H
#define _IOKIT_AppleUSBUHCI_H

#if DEBUG_LEVEL != DEBUG_LEVEL_PRODUCTION
#define IOASSERT 1
#include <IOKit/assert.h>
#endif

#include <libkern/OSByteOrder.h>

extern "C" {
#include <kern/queue.h>
}

#include <IOKit/IOService.h>
#include <IOKit/IOInterruptEventSource.h>
#include <IOKit/IOFilterInterruptEventSource.h>
#include <IOKit/IOBufferMemoryDescriptor.h>
#include <IOKit/IOTimerEventSource.h>
#include <IOKit/pci/IOPCIBridge.h>
#include <IOKit/pci/IOPCIDevice.h>
#include <IOKit/IOReturn.h>

#include <IOKit/usb/USB.h>
#include <IOKit/usb/USBHub.h>
#include <IOKit/usb/IOUSBControllerV2.h>

#include "UHCI.h"

/* Convert USBLog to use kprintf debugging */
#define UHCI_USE_KPRINTF 0

#if UHCI_USE_KPRINTF
#undef USBLog
#undef USBError
void kprintf(const char *format, ...)
__attribute__((format(printf, 1, 2)));
#define USBLog( LEVEL, FORMAT, ARGS... )  if ((LEVEL) <= 5) { kprintf( FORMAT "\n", ## ARGS ) ; }
#define USBError( LEVEL, FORMAT, ARGS... )  { kprintf( FORMAT "\n", ## ARGS ) ; }
#endif

#ifdef __ppc__
#define IOSync eieio
#else
#define IOSync() __asm__ __volatile__ ( "mfence" : : : "memory" )
#endif

/* Whether to use vertical TD queues, or fair queues. */
#define UHCI_USE_VERTICAL_QUEUES 0

#if UHCI_USE_VERTICAL_QUEUES
#define kUHCI_VERTICAL_FLAG  (kUHCI_TD_VF)
#else
#define kUHCI_VERTICAL_FLAG  (0)
#endif

#define USB_CONSTANT16(x)	(OSSwapHostToLittleConstInt16(x))
#define MICROSECOND		(1)
#define MILLISECOND		(1000)
#define NANOSECOND_TO_MILLISECOND (1000000)

#define kUHCI_RESET_DELAY 100   /* reset takes 100ms */

/* The audio hack tries to copy unaligned data into isoc output buffers
 * just before they are needed.  Currently unimplemented.
 */
#define AUDIO_HACK 0

/* Software queue head structure.
 */
typedef struct AppleUHCIQH {
    struct UHCIQH       hw;         /* Hardware structure; must come first. */
    IOPhysicalAddress   paddr;      /* Physical address of this structure. */
    int                 vframe;     /* Virtual frame location of this QH, if any. */
    struct AppleUHCIQH *hlink;
    struct AppleUHCITD *elink;      /* First TD */
    struct AppleUHCIQH *qlink;      /* QH link */
} QH;

/* Software transaction descriptor structure.
 */
typedef struct AppleUHCITD {
    struct UHCITD       hw;         /* Hardware structure; must come first. */
    IOPhysicalAddress   paddr;      /* Physical address of this structure. */
    struct UHCIAlignmentBuffer  *buffer;     /* Buffer for unaligned transactions. */
    IOUSBLowLatencyIsocFrame *fllp; /* Pointer to low-latency isoc frame for this TD. */
    struct AppleUHCITD *link;
} TD;

/* It is possible to use a shorter list of "virtual" frames to reduce the memory requirement
 * of 1024 physical frames.
 * This value should be a power of two that is less than or equal to kUHCI_FRAME_COUNT.
 * Having more virtual frames will allow queueing more isochronous frames.
 */

#define kUHCI_NVFRAMES 1024
/* 2 ^ (kUHCI_NINTR_QHS - 1) == kUHCI_NVFRAMES */
#define kUHCI_NINTR_QHS 11

#define kUHCI_NVFRAMES_MASK (kUHCI_NVFRAMES-1)

/* Minimum frame offset for scheduling an isochronous transaction. */
enum {
    kUHCI_MIN_FRAME_OFFSET = 1
};

/* Key for identifying isoc frames that span two TDs. */
enum {
    kUHCI_ISOC_SPAN_TD = (err_local|err_sub(0x99)|0x42)
};


struct VirtualFrame {
    TD *td;
    QH *first_qh;
    QH *last_qh;
    int numIntr;
};

/* Make a structure for transactions so we can queue them.
*/

// Transaction state
enum {
    kUHCI_TP_STATE_NULL,
    kUHCI_TP_STATE_FREE,
    kUHCI_TP_STATE_ACTIVE,
    kUHCI_TP_STATE_COMPLETE,
    kUHCI_TP_STATE_ABORTED
};

typedef struct UHCITransaction {
    IOMemoryDescriptor *    buf;
    UInt32                  bufLen;
    int                     nCompletions;
    IOUSBCompletion         completion;
    IOUSBCommand *          command;
    QH *                    qh;
    TD *                    first_td;
    TD *                    last_td;
    int                     state;
    int                     type;
    AbsoluteTime            timestamp;
    UInt32                  timeout;    // in ms
    
    /* Isochronous support */
    IOUSBIsocCompletion     isoc_completion;
    bool                    isoc_low_latency;
    bool                    isoc_unaligned;
    void *                  isoc_frames;
    UInt32                  isoc_num_frames;
    UInt32                  isoc_start_frame;
    IOMemoryMap *           isoc_map;
    
    UInt64                  isoc_full_start_frame;
    UInt64                  isoc_request_received;
    
    struct UHCIEndpoint *   endpoint;
    
    queue_chain_t           active_chain;     // Chain of all active transactions.
    queue_chain_t           endpoint_chain;   // Chain of active transactions for this endpoint.
} UHCITransaction;

// Leave room for block descriptor at end of chunk
// to round out to a nice IOMalloc allocation size.
#define kNTransactionChunk 30

typedef struct UHCIEndpoint {
    UInt16				functionNumber;
    UInt16				endpointNumber;
    UInt16				direction;
    UInt16                              speed;
    UInt16				maxPacketSize;
    UInt16                              pollingRate;  // For interrupt endpoints.
    UInt32                              type;         // Control, interrupt, etc.
    bool                                stalled;
    
    bool                                lastDBit;
    AbsoluteTime                        timestamp;
    
    /* Location after which to queue transactions. */
    QH *                                head_qh;

