apple-open-source/macos/IOUSBFamily/AppleUSBUHCI/Headers/AppleUSBUHCI.h
    /* Support for isochronous endpoints. */
    TD **                               isoc_tds;
    
    /* Interrupt chain used for interrupt endpoints. */
    UInt32                              intr_queue;
    
    TD *                                firstTD;      // Request queue.
    TD *                                lastTD;
    
    //queue_head_t                        pendingTransactions;
    queue_head_t                        activeTransactions; // Chain of active transactions
                                                      // for this endpoint.

    queue_head_t                        freeBuffers;
    int                                 buffersInUse;
    UInt16                              maxBufferSize; // Used for isoc endpoints
    queue_head_t                        allocatedBuffers; // Data blocks for buffering
                                                      // unaligned transactions.
    
    queue_chain_t                       chain;        // Chain of all endpoints.
} UHCIEndpoint;

/*
 * Buffers for unaligned transaction.
 * The size of the buffer is the maxPacketSize
 * of the associated endpoint.
 */
typedef struct UHCIAlignmentBuffer {
    IOPhysicalAddress       paddr;
    IOVirtualAddress        vaddr;
    /* For standard transfers */
    IOMemoryDescriptor *    userBuffer;
    IOByteCount             userOffset;
    /* For isochronous transfers */
    IOVirtualAddress        userAddr;
    IOByteCount             userLength;
    /* Fields used by filter interrupt routine */
    UHCIAlignmentBuffer     *next;
    UInt32                  frameNumber;
    UInt32                  copyAtInterruptTime;
    /* Queue fields */
    queue_chain_t           chain;
} UHCIAlignmentBuffer;

enum {
    kUHCI_BUFFER_ALIGN = 4
};

/* Checking for idleness.
 */
enum
{
    kUHCICheckForRootHubConnectionsPeriod = 30000,  // Check every 30 seconds for connections
    kUHCICheckForRootHubInactivityPeriod = 30000    // Wait 30 seconds for root hub to be idle
};    

/*
 * Power management.
 */

enum
{
    kUHCIPowerLevelSuspend		= 0,
    kUHCIPowerLevelRunning		= 1,
    kUHCIPowerLevelIdleSuspend          = 2
};

/*
 * Errata bits.  Eventually this should move into the USB family
 * errata bits when it is documented properly.
 */
enum
{
    kUHCIResetAfterBabble   = 1
};


class AppleUSBUHCI : public IOUSBControllerV2
{
    OSDeclareDefaultStructors(AppleUSBUHCI)


private:
    void ioWrite8(UInt16 offset, UInt8 value);
    void ioWrite16(UInt16 offset, UInt16 value);
    void ioWrite32(UInt16 offset, UInt32 value);
    UInt8 ioRead8(UInt16 offset);
    UInt16 ioRead16(UInt16 offset);
    UInt32 ioRead32(UInt16 offset);

    inline void Command(UInt16 cmd) {
      ioWrite16(kUHCI_CMD, cmd);
    }
    /* Port numbers for these functions are 0-based. */
    inline UInt16 ReadPortStatus(int port) {
        return ioRead16(kUHCI_PORTSC1 + (port * 2));
    }
    inline void WritePortStatus(int port, UInt16 value) {
        ioWrite16(kUHCI_PORTSC1 + (port * 2), value);
    }
    inline UInt16 ReadFrameNumberRegister(void) {
        return (ioRead16(kUHCI_FRNUM) & kUHCI_FRNUM_MASK);
    }
    inline UInt16 ReadFrameNumber(void) {
        return (ioRead16(kUHCI_FRNUM) & kUHCI_FRNUM_FRAME_MASK);
    }
    
    void SetVendorInfo(void);
    void SetDeviceName(void);



protected:
    IOPCIDevice *       _device;
    IOMemoryMap *       _ioMap;
    IOPhysicalAddress   _ioPhysAddress;
    IOVirtualAddress    _ioVirtAddress;
    UInt16              _ioBase;
    UInt16              _vendorID;
    UInt16              _deviceID;
    UInt16              _revisionID;
    UInt32              _errataBits;
    int                 _deviceNameLen;
    const char *        _deviceName;
    IOFilterInterruptEventSource *_interruptSource;
    bool		_uimInitialized;
    
    /* Allocation of QHs and TDs */
    QH *                _freeQHs;
    TD *                _freeTDs;
//    AllocatedBlock *    _allocatedBlocks;
    queue_head_t        _allocatedBuffers;
    
    /* Timeouts. */
    AbsoluteTime        _lastTime;
    
    /* 64-bit frame number support. */
    IOLock *            _frameLock;
    UInt32              _lastFrameNumberLow;
    UInt32              _lastFrameNumberHigh;
    
    AbsoluteTime        _lastFrameNumberTime;
    UInt64              _lastTimeoutFrameNumber;
    
    /* Copying buffers at interrupt time. */
    UHCIAlignmentBuffer * _interruptAlignmentBuffers;

    /* Interrupt status bits. */
    UInt32              _intrStatus;
    
    /* Isochronous bandwidth management. */
    UInt32              _isocBandwidth;

    /* Frame management. */
    IOPhysicalAddress   _framesPaddr;  // Physical frames.
    struct VirtualFrame _vframes[kUHCI_NVFRAMES]; // Virtual frame list.
    
    /* Queue management. */
    QH * _lastQH;
    QH * _bulkQHStart;
    QH * _bulkQHEnd;
    QH * _hsControlQHStart;
    QH * _hsControlQHEnd;
    QH * _lsControlQHStart;
    QH * _lsControlQHEnd;
    
    /* Interrupt queues. */
    QH * _intrQH[kUHCI_NINTR_QHS];

    /* Endpoint management. */
    queue_head_t _endpoints;
    
    /* In-process transaction management. */
    queue_head_t _freeTransactions;
    queue_head_t _activeTransactions;
    
    void StartTransaction(UHCITransaction *tp);
    void RemoveTransaction(UHCITransaction *tp);
    void CompleteTransaction(UHCITransaction *tp, IOReturn returnCode);
    void FixEndpointDBits(UHCIEndpoint *ep);

    IOReturn TDToUSBError(UInt32 error);
    void CompleteIsoc(IOUSBIsocCompletion   completion,
                      IOReturn              status,
                      void *                pFrames);
    
    /* Root hub support. */
    IOTimerEventSource * _rhTimer;
    UInt16 _rootFunctionNumber;
    UInt16 _lastPortStatus[kUHCI_NUM_PORTS];
    bool   _portWasReset[kUHCI_NUM_PORTS];
    bool   _portSuspendChange[kUHCI_NUM_PORTS];
    queue_head_t _rhIntrTransactions;
    UHCIEndpoint *_rhEndpoint;
    AbsoluteTime _rhChangeTime;

    IOReturn RHAbortEndpoint (short endpointNumber, short direction);
    IOReturn RHDeleteEndpoint (short endpointNumber, short direction);
    IOReturn RHCreateInterruptTransfer(IOUSBCommand * command);
    IOReturn RHCreateInterruptEndpoint(
                                       short				endpointNumber,
                                       UInt8				direction,
                                       short				speed,
                                       UInt16				maxPacketSize,
                                       short				pollingRate);
    static void RHTimerFired(OSObject *owner, IOTimerEventSource *sender);
    AbsoluteTime	RHLastPortStatusChanged(void);
    bool		RHAreAllPortsDisconnected(void);
    void                RHCheckStatus(void);

    /* Port numbers are 1-based. */
    void     RHEnablePort(int port, bool enable);
    IOReturn RHSuspendPort(int port, bool suspend);
    IOReturn RHResetPort(int port);
    
