apple-open-source/macos/IOUSBFamily/AppleUSBUHCI/Headers/AppleUSBUHCI.h
    void     RHDumpPortStatus(int port); // Debugging.
    void     RHDumpHubPortStatus(IOUSBHubPortStatus *status);

    
    virtual IOReturn GetRootHubStringDescriptor(UInt8	index, OSData *desc);

    void    StopEndpoint(UHCIEndpoint *ep);
    void    ReturnEndpointTransactions(UHCIEndpoint *ep, IOReturn status);
        
    /* UIM support. */
    void UIMProcessDoneQueue(IOUSBCompletionAction safeAction=0);
    void UIMRootHubStatusChange( void );
    void UIMRootHubStatusChange(bool abort);
    
    UHCIEndpoint * FindEndpoint(IOUSBCommand *command);
    UHCIEndpoint * FindEndpoint(short functionNumber, short endpointNumber, UInt8 direction);
    IOReturn DeleteEndpoint(short functionNumber, short endpointNumber, UInt8 direction);

    /* Interrupt handling. */
    static void InterruptHandler(OSObject *owner,
                                 IOInterruptEventSource * /*source*/,
                                 int /*count*/);
    static bool PrimaryInterruptFilter(OSObject *owner, IOFilterInterruptEventSource *source);

    bool FilterInterrupt(void);
    void HandleInterrupt(void);
    bool HandleShortPacket(UHCITransaction *tp, TD *td);
    bool IsTransactionComplete(UHCITransaction *tp);
    int ProcessCompletedTransactions(void);
    
    /* Resetting. */
    void GlobalReset(void);
    IOReturn Reset(bool enableInterrupts = false);
    
    /* Initializing hardware and setup. */
    IOReturn HardwareInit(void);
    IOReturn Run(bool);
    
    /* Memory management. */
    struct AppleUHCITD * AllocTD(void);
    void FreeTD(struct AppleUHCITD *);
    struct AppleUHCIQH * AllocQH(void);
    void FreeQH(struct AppleUHCIQH *);
    UHCITransaction * AllocTransaction(UHCIEndpoint *);
    void FreeTransaction(UHCITransaction *);
    UHCIEndpoint * AllocEndpoint(void);
    UHCIEndpoint * AllocEndpoint(UInt16 functionNumber,
                                 UInt16 endpointNumber,
                                 UInt16 direction,
                                 UInt16 speed,
                                 UInt16 maxPacketSize,
                                 UInt32 type);
    
    void FreeEndpoint(UHCIEndpoint *);
    UHCIAlignmentBuffer * EndpointAllocBuffer(UHCIEndpoint *ep);
    void EndpointFreeBuffer(UHCIEndpoint *ep, UHCIAlignmentBuffer *bp);
    IOReturn EndpointFreeAllBuffers(UHCIEndpoint *ep);


    IOReturn AllocTDChain(UHCIEndpoint *ep,
                          IOMemoryDescriptor *mp,
                          IOByteCount len,
                          bool shortOK,
                          short direction,
                          TD **start_p, TD **end_p,
                          bool setVFlag = false,
                          bool isControlTranser = false);
    
    void FreeTDChain(TD *td);


    /* Debugging. */
    void DumpTransaction(UHCITransaction *tp, int level = 7);
    void DumpTD(TD *td, int level = 7);
    void DumpTDChain(TD *td, bool qhOK = false, int level = 7);
    void DumpQH(QH *, int level = 7);
    void DumpQHChain(QH *, int level = 7);
    void DumpFrame(UInt16 frame = 0, int level = 7);
    void DumpEndpoint(UHCIEndpoint *ep, int level = 7);
    void SingleStep(int count, bool runAfter);


    /*
     * Isochronous support.
     */
    IOReturn CreateIsochTransfer(
                                 short				functionAddress,
                                 short				endpointNumber,
                                 IOUSBIsocCompletion		completion,
                                 UInt8				direction,
                                 UInt64				frameStart,
                                 IOMemoryDescriptor *		pBuffer,
                                 UInt32				frameCount,
                                 void * 			pFrames,
                                 UInt32                         updateFrequency,
                                 bool                           isLowLatency);
    
    IOReturn StartIsochTransfer(
                                         UHCITransaction *tp
                                         );
        
    /*
     * Power management.
     */
    bool _unloadUIMAcrossSleep;
    UInt32 _saveFrameAddress;
    UInt16 _saveFrameNumber;
    bool _remoteWakeupOccurred;
    int _powerLevel;
    IONotifier *_powerDownNotifier;
    
    virtual void initForPM (IOPCIDevice *provider);
    unsigned long maxCapabilityForDomainState ( IOPMPowerFlags domainState );
    unsigned long initialPowerStateForDomainState ( IOPMPowerFlags domainState );
    static IOReturn 	PowerDownHandler(void *target, void *refCon, UInt32 messageType, IOService *service,
                                         void *messageArgument, vm_size_t argSize);
    
    virtual IOReturn setPowerState( unsigned long powerStateOrdinal, IOService* whatDevice );
    
    void ResumeController(void);
    void SuspendController(void);
    void StopController(void);
    void RestartController(void);
    void EnableUSBInterrupt(bool enableInterrupt);    
    
public:
    virtual bool 	init(OSDictionary * propTable);
    virtual bool 	start( IOService * provider );
    virtual void 	stop( IOService * provider );
    virtual bool 	finalize(IOOptionBits options);
    virtual IOReturn 	message( UInt32 type, IOService * provider,  void * argument = 0 );

    /*
     * UIM methods
     */
    IOReturn UIMInitialize(IOService * provider);
    IOReturn UIMFinalize();
    IOReturn UIMInitializeForPowerUp();
    IOReturn UIMFinalizeForPowerDown();
    
    // Control
    virtual IOReturn UIMCreateControlEndpoint(
            UInt8				functionNumber,
            UInt8				endpointNumber,
            UInt16				maxPacketSize,
            UInt8				speed);
    
    virtual IOReturn UIMCreateControlEndpoint(
            UInt8				functionNumber,
            UInt8				endpointNumber,
            UInt16				maxPacketSize,
            UInt8				speed,
            USBDeviceAddress    		highSpeedHub,
            int			                highSpeedPort);
    
    // method in 1.8 and 1.8.1
   virtual IOReturn UIMCreateControlTransfer(
            short				functionNumber,
            short				endpointNumber,
            IOUSBCompletion			completion,
            void *				CBP,
            bool				bufferRounding,
            UInt32				bufferSize,
            short				direction);
    //same method in 1.8.2
   virtual IOReturn UIMCreateControlTransfer(
            short				functionNumber,
            short				endpointNumber,
            IOUSBCommand*			command,
            void *				CBP,
            bool				bufferRounding,
            UInt32				bufferSize,
            short				direction);

    // method in 1.8 and 1.8.1
    virtual IOReturn UIMCreateControlTransfer(
            short				functionNumber,
            short				endpointNumber,
            IOUSBCompletion			completion,
            IOMemoryDescriptor *		CBP,
            bool				bufferRounding,
            UInt32				bufferSize,
            short				direction);

    //same method in 1.8.2
    virtual IOReturn UIMCreateControlTransfer(
            short				functionNumber,
            short				endpointNumber,
            IOUSBCommand*			command,
            IOMemoryDescriptor *		CBP,
            bool				bufferRounding,
            UInt32				bufferSize,
            short				direction);

    // Bulk
    virtual IOReturn UIMCreateBulkEndpoint(
            UInt8				functionNumber,
            UInt8				endpointNumber,
            UInt8				direction,
            UInt8				speed,
            UInt8				maxPacketSize);
    
    virtual IOReturn UIMCreateBulkEndpoint(
            UInt8				functionNumber,
            UInt8				endpointNumber,
            UInt8				direction,
            UInt8				speed,
            UInt16				maxPacketSize,
            USBDeviceAddress    		highSpeedHub,
            int			                highSpeedPort);
    
    // method in 1.8 and 1.8.1
    virtual IOReturn UIMCreateBulkTransfer(
            short				functionNumber,
            short				endpointNumber,
            IOUSBCompletion			completion,
            IOMemoryDescriptor *		CBP,
            bool				bufferRounding,
            UInt32				bufferSize,
            short				direction);

